driver-tests/sqlse/db2/SqlSE1112_DB2/UpdateWithFalseConJbi/test/SqlSE1112_DB2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:UpdateWithFalseConRequest>
      <sql:param1>0</sql:param1>
    </sql:UpdateWithFalseConRequest>
  </soapenv:Body>
</soapenv:Envelope>